In [25]:
import pandas as pd
import numpy as np

In [6]:
data1 = {'Name':['Jai', 'Anuj', 'Jai', 'Princi','Gaurav', 'Anuj', 'Princi', 'Abhi'],        'Age':[27, 24, 22, 32,33, 36, 27, 32],         'College':['SRM','SRM','VIT','VIT','IIT','IIT','NIT','NIT'],        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj','Jaunpur', 'Kanpur', 'Allahabad', 'Aligarh'],        'Qualification':['Msc', 'MA', 'MCA', 'Phd','B.Tech', 'B.com', 'Msc', 'MA']}

In [8]:
df = pd.DataFrame(data1)

In [9]:
print(df)

     Name  Age College    Address Qualification
0     Jai   27     SRM     Nagpur           Msc
1    Anuj   24     SRM     Kanpur            MA
2     Jai   22     VIT  Allahabad           MCA
3  Princi   32     VIT    Kannuaj           Phd
4  Gaurav   33     IIT    Jaunpur        B.Tech
5    Anuj   36     IIT     Kanpur         B.com
6  Princi   27     NIT  Allahabad           Msc
7    Abhi   32     NIT    Aligarh            MA

In [12]:
print(df.groupby('College').groups)

{'IIT': [4, 5], 'NIT': [6, 7], 'SRM': [0, 1], 'VIT': [2, 3]}

In [13]:
gk = df.groupby('College')

In [14]:
gk.first()

           Name  Age    Address Qualification
College
IIT      Gaurav   33    Jaunpur        B.Tech
NIT      Princi   27  Allahabad           Msc
SRM         Jai   27     Nagpur           Msc
VIT         Jai   22  Allahabad           MCA

In [15]:
df.groupby(['College','Qualification'])
print(df.groupby(['College','Qualification']).groups)

{('IIT', 'B.Tech'): [4], ('IIT', 'B.com'): [5], ('NIT', 'MA'): [7], ('NIT', 'Msc'): [6], ('SRM', 'MA'): [1], ('SRM', 'Msc'): [0], ('VIT', 'MCA'): [2], ('VIT', 'Phd'): [3]}

## Pivoting

In [19]:
df = pd.read_csv(r"C:\Users\shahp\OneDrive\Desktop\FDA\Classwork\nba.csv")

In [20]:
print(df.head())

            Name            Team  Number Position   Age Height  Weight  \
0  Avery Bradley  Boston Celtics     0.0       PG  25.0    6-2   180.0
1    Jae Crowder  Boston Celtics    99.0       SF  25.0    6-6   235.0
2   John Holland  Boston Celtics    30.0       SG  27.0    6-5   205.0
3    R.J. Hunter  Boston Celtics    28.0       SG  22.0    6-5   185.0
4  Jonas Jerebko  Boston Celtics     8.0       PF  29.0   6-10   231.0

             College     Salary
0              Texas  7730337.0
1          Marquette  6796117.0
2  Boston University        NaN
3      Georgia State  1148640.0
4                NaN  5000000.0

In [21]:
df_stacked = df.stack()
print(df_stacked.head(26))

0  Name            Avery Bradley
   Team           Boston Celtics
   Number                    0.0
   Position                   PG
   Age                      25.0
   Height                    6-2
   Weight                  180.0
   College                 Texas
   Salary              7730337.0
1  Name              Jae Crowder
   Team           Boston Celtics
   Number                   99.0
   Position                   SF
   Age                      25.0
   Height                    6-6
   Weight                  235.0
   College             Marquette
   Salary              6796117.0
2  Name             John Holland
   Team           Boston Celtics
   Number                   30.0
   Position                   SG
   Age                      27.0
   Height                    6-5
   Weight                  205.0
   College     Boston University
dtype: object

In [23]:
print(df_stacked.unstack())

              Name            Team Number Position   Age Height Weight  \
0    Avery Bradley  Boston Celtics    0.0       PG  25.0    6-2  180.0
1      Jae Crowder  Boston Celtics   99.0       SF  25.0    6-6  235.0
2     John Holland  Boston Celtics   30.0       SG  27.0    6-5  205.0
3      R.J. Hunter  Boston Celtics   28.0       SG  22.0    6-5  185.0
4    Jonas Jerebko  Boston Celtics    8.0       PF  29.0   6-10  231.0
..             ...             ...    ...      ...   ...    ...    ...
452     Trey Lyles       Utah Jazz   41.0       PF  20.0   6-10  234.0
453   Shelvin Mack       Utah Jazz    8.0       PG  26.0    6-3  203.0
454      Raul Neto       Utah Jazz   25.0       PG  24.0    6-1  179.0
455   Tibor Pleiss       Utah Jazz   21.0        C  26.0    7-3  256.0
456    Jeff Withey       Utah Jazz   24.0        C  26.0    7-0  231.0

               College     Salary
0                Texas  7730337.0
1            Marquette  6796117.0
2    Boston University        NaN
3        Georgia State  1148640.0
4                  NaN  5000000.0
..                 ...        ...
452           Kentucky  2239800.0
453             Butler  2433333.0
454                NaN   900000.0
455                NaN  2900000.0
456             Kansas   947276.0

[457 rows x 9 columns]

In [26]:
longframe = pd.DataFrame({ 'color':['white','white','white','red','red','red','black','black','black'], 'item':['ball','pen','mug','ball','pen','mug','ball','pen','mug'],'value': np.random.rand(9)})
longframe

   color  item     value
0  white  ball  0.485315
1  white   pen  0.628522
2  white   mug  0.694992
3    red  ball  0.651374
4    red   pen  0.242434
5    red   mug  0.505961
6  black  ball  0.960656
7  black   pen  0.786330
8  black   mug  0.453034

In [27]:
wideframe = longframe.pivot('color','item')
wideframe

          value
item       ball       mug       pen
color
black  0.960656  0.453034  0.786330
red    0.651374  0.505961  0.242434
white  0.485315  0.694992  0.628522

In [32]:
frame1 = pd.DataFrame(np.arange(9).reshape(3,3), index=['white','black','red'], columns=['ball','pen','pencil'])
frame1

       ball  pen  pencil
white     0    1       2
black     3    4       5
red       6    7       8

In [33]:
del frame1['ball']
frame1

       pen  pencil
white    1       2
black    4       5
red      7       8

In [34]:
frame1.drop('white')

       pen  pencil
black    4       5
red      7       8

In [37]:
df = pd.DataFrame({"A":[12, 4, 5, None, 1],"B":[7, 2, 54, 3, None],"C":[20, 16, 11, 3, 8],"D":[14, 3, None, 2, 6]}) 
print(df)

      A     B   C     D
0  12.0   7.0  20  14.0
1   4.0   2.0  16   3.0
2   5.0  54.0  11   NaN
3   NaN   3.0   3   2.0
4   1.0   NaN   8   6.0

In [36]:
index_ = ['Row_1', 'Row_2', 'Row_3', 'Row_4', 'Row_5']

In [38]:
df.index = index_

In [39]:
print(df)

          A     B   C     D
Row_1  12.0   7.0  20  14.0
Row_2   4.0   2.0  16   3.0
Row_3   5.0  54.0  11   NaN
Row_4   NaN   3.0   3   2.0
Row_5   1.0   NaN   8   6.0

In [40]:
result = df.transform(func = lambda x : x + 10)
print(result)

          A     B   C     D
Row_1  22.0  17.0  30  24.0
Row_2  14.0  12.0  26  13.0
Row_3  15.0  64.0  21   NaN
Row_4   NaN  13.0  13  12.0
Row_5  11.0   NaN  18  16.0

In [42]:
data = pd.read_csv(r"C:\Users\shahp\OneDrive\Desktop\FDA\Classwork\student.csv")

In [43]:
data.sort_values("StuRegno",inplace=True)

In [44]:
data

    StuRegno Stuname Section  M1  M2  M3
0          1       A       A  93  66  90
1          1       B       B  91  65  91
2          1       C       A  89  64  92
3          4       D       B  87  63  93
4          5       r       A  85  62  94
5          5       I       B  83  61  95
6          5       t       A  81  60  96
7          8       e       B  79  59  97
8          9       w       A  77  58  98
9         10       q       B  75  57  99
10        10      rr       A  66  77  44
11        10      Tt       B  44  55  66

In [45]:
bool_series=data["StuRegno"].duplicated()

In [46]:
data.head()

   StuRegno Stuname Section  M1  M2  M3
0         1       A       A  93  66  90
1         1       B       B  91  65  91
2         1       C       A  89  64  92
3         4       D       B  87  63  93
4         5       r       A  85  62  94

In [47]:
data[bool_series]

    StuRegno Stuname Section  M1  M2  M3
1          1       B       B  91  65  91
2          1       C       A  89  64  92
5          5       I       B  83  61  95
6          5       t       A  81  60  96
10        10      rr       A  66  77  44
11        10      Tt       B  44  55  66

In [48]:
frame = pd.DataFrame({ 'item':['ball','mug','pen','pencil','ashtray'],'color':['white','rosso','verde','black','yellow'],'price':[5.56,4.20,1.30,0.56,2.75]})
frame

      item   color  price
0     ball   white   5.56
1      mug   rosso   4.20
2      pen   verde   1.30
3   pencil   black   0.56
4  ashtray  yellow   2.75

In [49]:
newcolors={'rosso':'red','verde':'green'}
frame.replace(newcolors)

      item   color  price
0     ball   white   5.56
1      mug     red   4.20
2      pen   green   1.30
3   pencil   black   0.56
4  ashtray  yellow   2.75

In [50]:
ser = pd.Series([1,3,np.nan,4,6,np.nan,3])
ser

0    1.0
1    3.0
2    NaN
3    4.0
4    6.0
5    NaN
6    3.0
dtype: float64

In [51]:
ser.replace(np.nan,0)

0    1.0
1    3.0
2    0.0
3    4.0
4    6.0
5    0.0
6    3.0
dtype: float64

In [52]:
frame = pd.DataFrame({'item':['ball','mug','pen','pencil','ashtray'],                      'color':['white','red','green','black','yellow']})
frame

      item   color
0     ball   white
1      mug     red
2      pen   green
3   pencil   black
4  ashtray  yellow

In [53]:
price = {
    'ball': 5.56,    'mug': 4.20,    'bottle': 1.30,    'scissors': 3.41,    'pen': 1.30,    'pencil': 0.56,    'ashtray': 2.75
}

In [54]:
frame['price'] = frame['item'].map(price)
frame

      item   color  price
0     ball   white   5.56
1      mug     red   4.20
2      pen   green   1.30
3   pencil   black   0.56
4  ashtray  yellow   2.75

In [55]:
frame = pd.DataFrame({'item':['ball','mug','pen','pencil','ashtray'],                      'color':['white','red','green','black','yellow'],                      'values':[ '5.56','4.20','1.30','0.56','2.75']})
frame

      item   color values
0     ball   white   5.56
1      mug     red   4.20
2      pen   green   1.30
3   pencil   black   0.56
4  ashtray  yellow   2.75

In [56]:
reindex = {    0: 'first',    1: 'second',    2: 'third',    3: 'fourth',    4: 'fifth' }

In [57]:
frame.rename(reindex)

           item   color values
first      ball   white   5.56
second      mug     red   4.20
third       pen   green   1.30
fourth   pencil   black   0.56
fifth   ashtray  yellow   2.75

In [58]:
recolumn = {    'item': 'object',    'values': 'price' }
frame.rename(index=reindex,columns=recolumn)

         object   color price
first      ball   white  5.56
second      mug     red  4.20
third       pen   green  1.30
fourth   pencil   black  0.56
fifth   ashtray  yellow  2.75